necropaz/cc13x2-cc26x2-driverlib/driverlib/pka.h
//*****************************************************************************
//
//! \brief Starts ECC multiplication.
//!
//! \param [in] scalar is pointer to the buffer containing the scalar
//!        value to be multiplied.
//!
//! \param [in] curvePointX is the pointer to the buffer containing the
//!        X coordinate of the elliptic curve point to be multiplied.
//!        The point must be on the given curve.
//!
//! \param [in] curvePointY is the pointer to the buffer containing the
//!        Y coordinate of the elliptic curve point to be multiplied.
//!        The point must be on the given curve.
//!
//! \param [in] prime is the prime of the curve.
//!
//! \param [in] a is the a constant of the curve when the curve equation is expressed
//!        in short Weierstrass form (y^3 = x^2 + a*x + b).
//!
//! \param [in] b is the b constant of the curve when the curve equation is expressed
//!        in short Weierstrass form (y^3 = x^2 + a*x + b).
//!
//! \param [in] length is the length of the curve parameters in bytes.
//!
//! \param [out] resultPKAMemAddr is the pointer to the result vector location
//!        which will be set by this function.
//!
//!\return Returns a status code.
//! - \ref PKA_STATUS_SUCCESS if successful in starting the operation.
//! - \ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
//!        some other operation.
//!
//! \sa PKAEccMultiplyGetResult()
//
//*****************************************************************************
extern uint32_t  PKAEccMultiplyStart(const uint8_t *scalar, const uint8_t *curvePointX, const uint8_t *curvePointY, const uint8_t *prime, const uint8_t *a, const uint8_t *b, uint32_t length, uint32_t *resultPKAMemAddr);

//*****************************************************************************
//
//! \brief Gets the result of ECC multiplication
//!
//! This function gets the result of ECC point multiplication operation on the
//! EC point and the scalar value, previously started using the function
//! PKAEccMultiplyStart().
//!
//! \param [out] curvePointX is the pointer to the structure where the X coordinate
//!         of the resultant EC point will be stored.
//!
//! \param [out] curvePointY is the pointer to the structure where the Y coordinate
//!         of the resultant EC point will be stored.
//!
//! \param [in] resultPKAMemAddr is the address of the result location which
//!        was provided by the start function PKAEccMultiplyStart().
//!
//! \param [in] length is the length of the curve parameters in bytes.
//!
//! \return Returns a status code.
//! - \ref PKA_STATUS_SUCCESS if the operation is successful.
//! - \ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
//!        the operation.
//! - \ref PKA_STATUS_RESULT_0 if the result is all zeros.
//! - \ref PKA_STATUS_FAILURE if the operation is not successful.
//!
//! \sa PKAEccMultiplyStart()
//
//*****************************************************************************
extern uint32_t  PKAEccMultiplyGetResult(uint8_t *curvePointX, uint8_t *curvePointY, uint32_t resultPKAMemAddr, uint32_t length);

//*****************************************************************************
//
//! \brief Starts the ECC addition.
//!
//! \param [in] curvePoint1X is the pointer to the buffer containing the
//!        X coordinate of the first elliptic curve point to be added.
//!        The point must be on the given curve.
//!
//! \param [in] curvePoint1Y is the pointer to the buffer containing the
//!        Y coordinate of the first elliptic curve point to be added.
//!        The point must be on the given curve.
//!
//! \param [in] curvePoint2X is the pointer to the buffer containing the
//!        X coordinate of the second elliptic curve point to be added.
//!        The point must be on the given curve.
//!
//! \param [in] curvePoint2Y is the pointer to the buffer containing the
//!        Y coordinate of the second elliptic curve point to be added.
//!        The point must be on the given curve.
//!
//! \param [in] prime is the prime of the curve.
//!
//! \param [in] a is the a constant of the curve when the curve equation is expressed
//!        in short Weierstrass form (y^3 = x^2 + a*x + b).
//!
//! \param [in] length is the length of the curve parameters in bytes.
//!
//! \param [out] resultPKAMemAddr is the pointer to the result vector location
//!        which will be set by this function.
//!
//!\return Returns a status code.
//! - \ref PKA_STATUS_SUCCESS if successful in starting the operation.
//! - \ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
//!        some other operation.
//!
//! \sa PKAEccAddGetResult()
//
//*****************************************************************************
extern uint32_t  PKAEccAddStart(const uint8_t *curvePoint1X, const uint8_t *curvePoint1Y, const uint8_t *curvePoint2X, const uint8_t *curvePoint2Y, const uint8_t *prime, const uint8_t *a, uint32_t length, uint32_t *resultPKAMemAddr);

//*****************************************************************************
//
//! \brief Gets the result of the ECC addition
//!
//! This function gets the result of ECC point addition operation on the
//! on the two given EC points, previously started using the function
//! PKAEccAddStart().
//!
//! \param [out] curvePointX is the pointer to the structure where the X coordinate
//!         of the resultant EC point will be stored.
//!
//! \param [out] curvePointY is the pointer to the structure where the Y coordinate
//!         of the resultant EC point will be stored.
//!
//! \param [in] resultPKAMemAddr is the address of the result location which
//!        was provided by the start function PKAEccAddGetResult().
//!
//! \param [in] length is the length of the curve parameters in bytes.
//!
//! \return Returns a status code.
//! - \ref PKA_STATUS_SUCCESS if the operation is successful.
//! - \ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing the operation.
//! - \ref PKA_STATUS_RESULT_0 if the result is all zeros.
//! - \ref PKA_STATUS_FAILURE if the operation is not successful.
//!
//! \sa PKAEccAddStart()
//
//*****************************************************************************
extern uint32_t  PKAEccAddGetResult(uint8_t *curvePointX, uint8_t *curvePointY, uint32_t resultPKAMemAddr, uint32_t length);

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#if !defined(DRIVERLIB_NOROM) && !defined(DOXYGEN)
    #include "../driverlib/rom.h"
    #ifdef ROM_PKAGetOpsStatus
        #undef  PKAGetOpsStatus
        #define PKAGetOpsStatus                 ROM_PKAGetOpsStatus
    #endif
    #ifdef ROM_PKABigNumModStart
        #undef  PKABigNumModStart
        #define PKABigNumModStart               ROM_PKABigNumModStart
    #endif
    #ifdef ROM_PKABigNumModGetResult
        #undef  PKABigNumModGetResult
        #define PKABigNumModGetResult           ROM_PKABigNumModGetResult
    #endif
    #ifdef ROM_PKABigNumCmpStart
        #undef  PKABigNumCmpStart
        #define PKABigNumCmpStart               ROM_PKABigNumCmpStart
    #endif
    #ifdef ROM_PKABigNumCmpGetResult
        #undef  PKABigNumCmpGetResult
        #define PKABigNumCmpGetResult           ROM_PKABigNumCmpGetResult
    #endif
    #ifdef ROM_PKABigNumInvModStart
        #undef  PKABigNumInvModStart
        #define PKABigNumInvModStart            ROM_PKABigNumInvModStart
    #endif
    #ifdef ROM_PKABigNumInvModGetResult
        #undef  PKABigNumInvModGetResult
        #define PKABigNumInvModGetResult        ROM_PKABigNumInvModGetResult
    #endif
    #ifdef ROM_PKABigNumMultiplyStart
        #undef  PKABigNumMultiplyStart
        #define PKABigNumMultiplyStart          ROM_PKABigNumMultiplyStart
    #endif
    #ifdef ROM_PKABigNumMultGetResult
        #undef  PKABigNumMultGetResult
        #define PKABigNumMultGetResult          ROM_PKABigNumMultGetResult
    #endif
    #ifdef ROM_PKABigNumAddStart
        #undef  PKABigNumAddStart
        #define PKABigNumAddStart               ROM_PKABigNumAddStart
    #endif
    #ifdef ROM_PKABigNumAddGetResult
        #undef  PKABigNumAddGetResult
        #define PKABigNumAddGetResult           ROM_PKABigNumAddGetResult
    #endif
    #ifdef ROM_PKABigNumSubStart
        #undef  PKABigNumSubStart
        #define PKABigNumSubStart               ROM_PKABigNumSubStart
    #endif
    #ifdef ROM_PKABigNumSubGetResult
        #undef  PKABigNumSubGetResult
        #define PKABigNumSubGetResult           ROM_PKABigNumSubGetResult
    #endif
    #ifdef ROM_PKAEccMultiplyStart
        #undef  PKAEccMultiplyStart
        #define PKAEccMultiplyStart             ROM_PKAEccMultiplyStart
    #endif
    #ifdef ROM_PKAEccMultiplyGetResult
        #undef  PKAEccMultiplyGetResult
        #define PKAEccMultiplyGetResult         ROM_PKAEccMultiplyGetResult
    #endif
    #ifdef ROM_PKAEccAddStart
        #undef  PKAEccAddStart
        #define PKAEccAddStart                  ROM_PKAEccAddStart
    #endif
    #ifdef ROM_PKAEccAddGetResult
        #undef  PKAEccAddGetResult
        #define PKAEccAddGetResult              ROM_PKAEccAddGetResult
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif  // __PKA_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
